      *NAME: ANJU CHAWLA
      *DATE: MAY 10, 2013
      *PURPOSE:TO PRINT A WELCOME MESSAGE
      
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. ANJU CHAWLA.
       INSTALLATION. PC.
       DATE-WRITTEN. MAY 10, 2013.
       DATE-COMPILED. 
       SECURITY. ONLY USED BY ABC DEPARTMENT.
      *****************************************************
      
       ENVIRONMENT DIVISION.
       
      *****************************************************
       DATA DIVISION.
       
      ******************************************************
       PROCEDURE DIVISION.
       100-MAIN-MODULE.
           DISPLAY "HELLO WORLD!!"
           DISPLAY "WELCOME TO COBOL PROGRAMMING. IT IS FUN."
      -    "HOPE YOU LOVE IT!!"     
           STOP RUN.
      ********************************************************     
           
        
       